---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarHostData
source: html/61b89315-994e-e494-45f0-cfe585450b2e.htm
---
# RebarHostData Methods

Returns all AreaReinforcement elements hosted by the referenced element.